miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx.c
    /* Enable the RTC interrupts */
    rtc_enable_ints();

    /* Set callback function for interrupts */
    rcb.p_callback = p_init->p_callback;

    /* Set the periodic frequency */
    rtc_set_periodic(p_init->periodic_freq, p_init->periodic_priority);

    /* Start the RTC counter */
    rtc_counter_run(RTC_COUNTER_START);

    /* Remember that RTC is initialized. */
    rcb.initialized = true;

    return err;     // SUCCESS
}
/**********************************************************************************************************************
End of function R_RTC_Open
***********************************************************************************************************************/


#if (RTC_CFG_PARAM_CHECKING_ENABLE)
/***********************************************************************************************************************
* Function Name: check_valid_time
* Description  : Checks to make sure date/time fields are in range.
* Arguments    : p_time -
*                    Pointer to time structure.
* Return Value : true -
*                    Time information is valid.
*                false -
*                    Time information is invalid.
***********************************************************************************************************************/
static bool check_valid_time (tm_t * p_time)
{
    /* Used for computing max day of the month. */
    uint32_t max_days;

    /* Check seconds. */
    if ((p_time->tm_sec < 0) || (p_time->tm_sec > 59))
    {
        return false;
    }

    /* Check minutes. */
    if ((p_time->tm_min < 0) || (p_time->tm_min > 59))
    {
        return false;
    }

    /* Check hours. */
    if ((p_time->tm_hour < 0) || (p_time->tm_hour > 23))
    {
        return false;
    }

    /* Check day of the week. */
    if ((p_time->tm_wday < 0) || (p_time->tm_wday > 6))
    {
        return false;
    }

    /* Check month. */
    if ((p_time->tm_mon < 0) || (p_time->tm_mon > 11))
    {
        return false;
    }

    /* Check day of the month. */
    /* First compute max days in a month. */
    max_days = g_days_in_month[p_time->tm_mon];

    /* If month is February and this is leap year then add 1 more day. */
    if (1 == p_time->tm_mon)
    {
        /* Check if leap year. */
        if (leap_year_test(p_time->tm_year + 1900))
        {
            /* Add 1 day for leap year. */
            max_days += 1;
        }
    }

    if ((p_time->tm_mday <= 0) || (p_time->tm_mday > max_days))
    {
        return false;
    }

    /* Check year */
    /* MCUs supports years 2000-2099; adjust for years since 1900 */
    if ((p_time->tm_year < 100) || (p_time->tm_year >= 200))
    {
        return false;
    }

    return true;
}
/**********************************************************************************************************************
End of function check_valid_time
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_check_periodic
* Description  : This function checks to see if the periodic interrupt parameters are valid.
* Arguments    : freq
*                   - frequency; must match enum
*                priority
*                   - interrupt priority; between 0 and 15 (inclusive)
*                p_callback
*                   - callback function pointer; non-NULL
* Return Value : RTC_SUCCESS
*                   - arguments are valid
*                RTC_ERR_BAD_PARAM
*                   - priority out of range
*                RTC_ERR_MISSING_CALLBACK
*                   - callback function required but not specified
***********************************************************************************************************************/
static rtc_err_t rtc_check_periodic (rtc_periodic_t freq, uint8_t priority, rtc_cb_func_t p_callback)
{

    if ((RTC_PERIODIC_OFF != freq) && ((freq < RTC_PERIODIC_256_HZ) || (freq > RTC_PERIODIC_2_SEC)))
    {
        return RTC_ERR_BAD_PARAM;
    }

    if (RTC_PERIODIC_OFF != freq)
    {
        if (NULL == p_callback)
        {
            return RTC_ERR_MISSING_CALLBACK;
        }
        if (priority > 15)
        {
            return RTC_ERR_BAD_PARAM;
        }
    }

    return RTC_SUCCESS;
}
/**********************************************************************************************************************
End of function rtc_check_periodic
***********************************************************************************************************************/
#endif  /* if parameter checking on */


/***********************************************************************************************************************
* Function Name: leap_year_test
* Description  : Determines whether this is a leap year.
* Arguments    : curr_year -
*                    Year to check.
* Return Value : true
*                    - Input year is a leap year.
*                false
*                    - Input year is not a leap year.
***********************************************************************************************************************/
static bool leap_year_test (int curr_year)
{
    /* Leap year or not? */
    bool is_leap = false;

    /* Leap year is a year divisible by 4 and not divisible by 100 (unless also divisible by 400).
     * So the year 2000 and 2400 are leap years, but 2100, 2200, and 2300 are not.
     * Years 2001, 2002, and 2003 are not leap years, but 2004 is.
     */
    if (0 == (curr_year % 400))
    {
        is_leap = true;
    }
    else if ((0 != (curr_year % 100)) && (0 == (curr_year % 4)))
    {
        is_leap = true;
    }
    else
    {
        /* Nothing to do */
    }

    return is_leap;
}
/**********************************************************************************************************************
End of function leap_year_test
***********************************************************************************************************************/


