miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx.c
/***********************************************************************************************************************
* Function Name: R_RTC_Control
* Description  : This function processes a variety of commands including setting alarms, setting output and
*                periodic interrupt frequencies, starting/stopping counters, and configuring/inspecting/stopping
*                capture events.
* Arguments    : cmd
*                   - command to process
*                p_argd
*                   - void pointer to arguments specific to command
* Return Value : RTC_SUCCESS
*                   - command executed successfully
*                RTC_ERR_NOT_OPENED
*                   - R_RTC_Open() not called yet
*                RTC_ERR_BAD_PARAM
*                   - missing, invalid, or unknown argument
*                RTC_ERR_MISSING_CALLBACK
*                   - callback function required but not specified
*                RTC_ERR_NO_CAPTURE
*                   - a capture event was not detected
*                RTC_ERR_TIME_FORMAT
*                   - time structure contains an out-of-range element
*                       RTC_SUCCESS = 0,
***********************************************************************************************************************/
rtc_err_t R_RTC_Control (rtc_cmd_t cmd, void *p_args)
{
    rtc_err_t           err=RTC_SUCCESS;
    rtc_output_t        output_freq;
    rtc_periodic_cfg_t  *p_periodic;
    rtc_alarm_ctrl_t    *p_alm_ctrl;
    tm_t                *p_time;
#if !defined(BSP_MCU_RX11_ALL) && !defined(BSP_MCU_RX130)
    rtc_capture_cfg_t   *p_capture;
    rtc_pin_t           pin;
#endif


    /* Has RTC been initialized yet? */
    if (!rcb.initialized)
    {
        return RTC_ERR_NOT_OPENED;
    }


#if (RTC_CFG_PARAM_CHECKING_ENABLE)
    if (((NULL == p_args) || (FIT_NO_PTR == p_args))
            && (RTC_CMD_START_COUNTERS != cmd)
            && (RTC_CMD_STOP_COUNTERS != cmd)
            && (RTC_CMD_PARTIAL_RESET != cmd))
    {
        return RTC_ERR_BAD_PARAM;
    }

    if (cmd >= RTC_CMD_END_ENUM)
    {
        return RTC_ERR_BAD_PARAM;
    }
#endif


    switch (cmd)
    {
        case RTC_CMD_SET_OUTPUT :
            output_freq = *((rtc_output_t *) p_args);
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if (output_freq >= RTC_OUTPUT_END_ENUM)
            {
                return RTC_ERR_BAD_PARAM;
            }
#endif
            rtc_set_output(output_freq);
        break;

        case RTC_CMD_SET_PERIODIC :
            p_periodic = (rtc_periodic_cfg_t *) p_args;
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            err = rtc_check_periodic(p_periodic->frequency, p_periodic->int_priority, rcb.p_callback);
            if (RTC_SUCCESS != err)
            {
                return err;
            }
#endif
            rtc_set_periodic(p_periodic->frequency, p_periodic->int_priority);
        break;

        case RTC_CMD_SET_CURRENT_TIME :
            p_time = (tm_t *) p_args;
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if (!check_valid_time(p_time))
            {
                return RTC_ERR_TIME_FORMAT;
            }
#endif
            rtc_set_current_time(p_time);
        break;

        case RTC_CMD_SET_ALARM_TIME :
            p_time = (tm_t *) p_args;
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if (!check_valid_time(p_time))
            {
                return RTC_ERR_TIME_FORMAT;
            }
#endif
            rtc_set_alarm_time(p_time);
        break;

        case RTC_CMD_ENABLE_ALARM :
            p_alm_ctrl = (rtc_alarm_ctrl_t *) p_args;
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if (p_alm_ctrl->int_priority > 15)
            {
                return RTC_ERR_BAD_PARAM;
            }
#endif
            rtc_enable_alarms(p_alm_ctrl);
        break;

        case RTC_CMD_START_COUNTERS :
            rtc_counter_run(RTC_COUNTER_START);
        break;

        case RTC_CMD_STOP_COUNTERS :
            rtc_counter_run(RTC_COUNTER_STOP);
        break;

        case RTC_CMD_PARTIAL_RESET :     // primarily Output clock, Alarms and Capture registers
            rtc_reset();
        break;

#if !defined(BSP_MCU_RX11_ALL) && !defined(BSP_MCU_RX130)
        case RTC_CMD_CONFIG_CAPTURE :
            p_capture = (rtc_capture_cfg_t *) p_args;
#if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if ((p_capture->pin >= RTC_NUM_PINS)
             || (p_capture->pin < 0)
             || (p_capture->edge >= RTC_EDGE_END_ENUM)
             || (p_capture->edge < 0)
             || ((RTC_FILTER_OFF != p_capture->filter) &&
                 (RTC_FILTER_DIV1 != p_capture->filter) &&
                 (RTC_FILTER_DIV32 != p_capture->filter)))
            {
                return RTC_ERR_BAD_PARAM;
            }
#endif
            rtc_config_capture(p_capture);
        break;

        case RTC_CMD_CHECK_PIN0_CAPTURE :
            err = rtc_check_capture(RTC_PIN_0, (tm_t *) p_args);
        break;

        case RTC_CMD_CHECK_PIN1_CAPTURE :
            err = rtc_check_capture(RTC_PIN_1, (tm_t *) p_args);
        break;

        case RTC_CMD_CHECK_PIN2_CAPTURE :
            err = rtc_check_capture(RTC_PIN_2, (tm_t *) p_args);
        break;

        case RTC_CMD_DISABLE_CAPTURE :
            pin = *((rtc_pin_t *) p_args);
    #if (RTC_CFG_PARAM_CHECKING_ENABLE)
            if ((pin >= RTC_NUM_PINS) || (pin < 0))
            {
                return RTC_ERR_BAD_PARAM;
            }
    #endif
            rtc_disable_capture(pin);
        break;

#endif /* not RX11x, RX130 */

        default :
            return RTC_ERR_BAD_PARAM;
    }

    return err;
}
/**********************************************************************************************************************
End of function R_RTC_Control
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: R_RTC_Read
* Description  : This function retrieves the current date/time and alarm date/time.
* Arguments    : p_current
*                   - time structure pointer for loading current date/time.
*                     Specify NULL or FIT_NO_PTR to skip reading the current time.
*                p_alarm
*                   - time structure pointer for loading alarm date/time.
*                     Specify NULL or FIT_NO_PTR to skip reading the alarm time.
* Return Value : RTC_SUCCESS
*                   - current date/time, alarm date/time, or both retrieved successfully
*                RTC_ERR_NOT_OPENED
*                   - RTC has not been initialized yet
***********************************************************************************************************************/
rtc_err_t R_RTC_Read (tm_t *p_current, tm_t *p_alarm)
{
#if (RTC_CFG_CALCULATE_YDAY == 1)
    int32_t loop;     // Loop counter
#endif      
    rtc_err_t ret = RTC_SUCCESS;

#if (RTC_CFG_PARAM_CHECKING_ENABLE)
    if (!rcb.initialized)
    {
        return RTC_ERR_NOT_OPENED;
    }
#endif

    /* Load current time */
    if ((FIT_NO_PTR != p_current) && (NULL != p_current))
    {
        rtc_read_current(p_current);

        /* Daylight Savings Time unknown */
        p_current->tm_isdst = -1;

        /* Initialize day of year */
        p_current->tm_yday = 0;

