miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx.c
#if (RTC_CFG_CALCULATE_YDAY == 1)
        /* Calculating days since January 1st. */
        for (loop = 0; loop < p_current->tm_mon; loop++)
        {
            /* Add days for previous months. */
            p_current->tm_yday += g_days_in_month[loop];

            /* Check for leap year. */
            if (1 == loop)
            {
                if (leap_year_test(p_current->tm_year+1900))
                {
                    /* Add 1 day leap year. */
                    p_current->tm_yday += 1;
                }
            }
        }

        /* Add days for this current month. */
        p_current->tm_yday += p_current->tm_mday;
        p_current->tm_yday -= 1; // range is [0, 365]
#endif      
    }

    /* Load alarm time */
    if ((FIT_NO_PTR != p_alarm) && (NULL != p_alarm))
    {
        rtc_read_alarm(p_alarm);
    }

    return ret;
}
/**********************************************************************************************************************
End of function R_RTC_Read
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: R_RTC_Close
* Description  : This function stops the counters and disables all RTC interrupts.
*                The sub-clock is not stopped.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void R_RTC_Close (void)
{

    if (false == rcb.initialized)
    {
        return;
    }

    rtc_counter_run(RTC_COUNTER_STOP);      // stop counters
    rtc_disable_ints();                     // disable interrupts
    rtc_reset();                            // clear capture and alarms

    /* Do NOT stop sub-clock in case needed by application */

    rcb.initialized = false;
    R_BSP_HardwareUnlock(BSP_LOCK_RTC);

    return;
}
/**********************************************************************************************************************
End of function R_RTC_Close
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: R_RTC_GetVersion
* Description  : Returns this module's version information.
*                The version number is encoded where the top 2 bytes are the major version number and the bottom 2 bytes
*                are the minor version number. For example, Version 4.25 would be returned as 0x00040019.
*                NOTE: This function is inlined by default.
* Arguments    : none
* Return Value : Encoded version number
***********************************************************************************************************************/
#pragma inline(R_RTC_GetVersion)
uint32_t R_RTC_GetVersion (void)
{
    return ((((uint32_t) RTC_RX_VERSION_MAJOR) << 16) | ((uint32_t) RTC_RX_VERSION_MINOR));
}
/**********************************************************************************************************************
End of function R_RTC_GetVersion
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_bcd_to_dec
* Description  : Converts from binary coded decimal (BCD) to decimal
* Arguments    : to_convert -
*                    Value to convert.
* Return Value : Converted value.
***********************************************************************************************************************/
int rtc_bcd_to_dec (uint8_t to_convert)
{
    return (int) ((((to_convert & 0xF0) >> 4) * 10) + (to_convert & 0x0F));
}
/**********************************************************************************************************************
End of function rtc_bcd_to_dec
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_dec_to_bcd
* Description  : Converts from decimal to binary coded decimal (BCD)
* Arguments    : to_convert -
*                    Value to convert.
* Return Value : Converted value.
***********************************************************************************************************************/
uint8_t rtc_dec_to_bcd (uint8_t to_convert)
{
    return (uint8_t) ((((to_convert / 10) << 4) & 0xF0) | (to_convert % 10));
}
/**********************************************************************************************************************
End of function rtc_dec_to_bcd
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_alm_isr
* Description  : This alarm interrupt handler calls the callback function with an event
*                indicating that an alarm event occurred.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
#pragma interrupt rtc_alm_isr(vect=VECT(RTC,ALM))
static void rtc_alm_isr (void)
{
    if ((NULL != rcb.p_callback) && (FIT_NO_FUNC != rcb.p_callback))
    {
        rtc_cb_evt_t event = RTC_EVT_ALARM;

        /* presence of callback function verified in Control() */
        rcb.p_callback(&event);
    }
}
/**********************************************************************************************************************
End of function rtc_alm_isr
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_prd_isr
* Description  : This periodic interrupt handler calls the callback function with an event
*                indicating that a periodic interrupt occurred.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
#pragma interrupt rtc_prd_isr(vect=VECT(RTC,PRD))
static void rtc_prd_isr (void)
{
    if ((NULL != rcb.p_callback) && (FIT_NO_FUNC != rcb.p_callback))
    {
        rtc_cb_evt_t event = RTC_EVT_PERIODIC;

        /* presence of callback function verified in Open() and Control() */
        rcb.p_callback(&event);
    }
}
/**********************************************************************************************************************
End of function rtc_prd_isr
***********************************************************************************************************************/

